In [4]:
import pandas as pd
df=pd.read_csv('data/titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [5]:
df=df.drop(['Name','PassengerId','Ticket','Cabin','Embarked','SibSp','Parch'],axis=1)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [6]:
target=df['Survived']
inputs=df.drop('Survived',axis=1)
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

## One hot encoding

In [10]:
final=pd.concat([inputs.drop('Sex',axis=1),pd.get_dummies(df['Sex'],drop_first=True)],axis=1)
final.head()

   Pclass   Age     Fare  male
0       3  22.0   7.2500     1
1       1  38.0  71.2833     0
2       3  26.0   7.9250     0
3       1  35.0  53.1000     0
4       3  35.0   8.0500     1

## Handi

In [11]:
final.isna().sum()

Pclass      0
Age       177
Fare        0
male        0
dtype: int64

In [14]:
final.fillna(final['Age'].median(),inplace=True)
final.isna().sum()

Pclass    0
Age       0
Fare      0
male      0
dtype: int64

In [20]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(final,target,test_size=0.2)

In [23]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()
model.fit(x_train,y_train)

GaussianNB()

In [24]:
model.score(x_test,y_test)

0.8268156424581006

## Cross validate

In [25]:
from sklearn.model_selection import cross_val_score
cvs_gaussian=cross_val_score(GaussianNB(),x_train,y_train)

In [26]:
cvs_gaussian.mean()

0.752743031616271